#include <iostream>

int main()
{
    std::cout << "Введите число от 0 до 255" << '\n';
    int x;
    std::cin >> x;
    int a{ 1 }, b{ 1 }, c{ 1 }, d{ 1 }, e{ 1 }, f{ 1 }, g{ 1 }, h{ 1 };
    //Все биты определил разными переменными со значением "1", далее логической операцией "если" либо уменьшается число, либо заменяется соответствующий бит
    (x >= 128) ? x -= 128 : a = 0;
    (x >= 64) ? x -= 64 : b = 0;
    (x >= 32) ? x -= 32 : c = 0;
    (x >= 16) ? x -= 16 : d = 0;
    (x >= 8) ? x -= 8 : e = 0;
    (x >= 4) ? x -= 4 : f = 0;
    (x >= 2) ? x -= 2 : g = 0;
    (x == 1) ? h = 1 : h = 0;
    std::cout << a << b << c << d << " " << e << f << g << h << '\n';
    return 0;
}